Octopus/Documents/vrgИнвентаризацияМобильная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>vrgИнвентаризацияМобильная</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУзлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданНаМобильномУстройстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этикетка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Octopus/InformationRegisters/vrgОстаткиНаСкладахМобильныеСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>vrgОстаткиНаСкладахМобильныеСклад</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Octopus/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображениеДобавлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазовыеЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоСериям</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Octopus/Documents/vrgИнвентаризацияМобильная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Если Автосохранение Тогда
		Возврат;
	КонецЕсли;

	УправлениеФормамиСервер.ОбработкаПроверкиЗаполненияДокументов(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)

	Если ОткрытаФормаРедактированияНоменклатуры Тогда
		Возврат;
	КонецЕсли;
	Если ФормаДокументаЗаблокирована Тогда
		Возврат;
	КонецЕсли;

	Если Событие = "UniversalBroadcastEvent" и Источник = глНомерУстройства Тогда
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.УстановитьСтроку(Данные);
		ПостроительDOM = Новый ПостроительDOM;
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		МассивЭлементов = ДокументDOM.ПолучитьЭлементыПоИмени("FilterData");
		Если МассивЭлементов.Количество() Тогда
			Штрихкод = МассивЭлементов[0].ТекстовоеСодержимое;
			ОбработатьВводШтрихкодаНаКлиенте();
			Если ОткрытаФормаСтроки Тогда
				СтруктураСканирования = Новый Структура();
				СтруктураСканирования.Вставить("Номенклатура", Номенклатура);
				СтруктураСканирования.Вставить("Количество", Количество);
				СтруктураСканирования.Вставить("ЦветФонаСтроки", ПолучитьЦветСтроки(Элементы.Товары.ТекущиеДанные));
				Оповестить("UniversalBroadcastEvent", СтруктураСканирования, ЭтаФорма);
			КонецЕсли;
		КонецЕсли;
		//Если ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
		//	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		//	Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;
		//КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруСтрокиТабЧастиТовары(ЭтоДобавление = Ложь, ЗаполнитьТекущимиДанными = Ложь)

	СтруктураСтроки = Новый Структура("НомерСтроки, Артикул, Номенклатура, Количество, Остаток, СерияНоменклатуры, ХарактеристикаНоменклатуры, Примечание, Этикетка");
	ЦветФонаСтроки = Новый Цвет;
	Если ЗаполнитьТекущимиДанными Тогда
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, ТекущиеДанные);
		ЦветФонаСтроки = ПолучитьЦветСтроки(ТекущиеДанные);
		СтруктураСтроки.Остаток = ТекущиеДанные.КоличествоУчет;
	КонецЕсли;
	Если ЭтоДобавление Тогда
		СтруктураСтроки.НомерСтроки = Объект.Товары.Количество() + 1;
	КонецЕсли;
	СтруктураСтроки.Вставить("РежимОбновленияКартинок", РежимОбновленияКартинок);
	СтруктураСтроки.Вставить("ЦветФонаСтроки", ЦветФонаСтроки);
	СтруктураСтроки.Вставить("ЭтоИнвентаризация", Истина);

	Возврат СтруктураСтроки;

КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)

	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	//ТекущиеДанные.КоличествоУчет = Разработка.ПолучитьОстаток(ТекущиеДанные.Номенклатура, Объект.Склад,
	//								ТекущиеДанные.СерияНоменклатуры, ТекущиеДанные.ТекущиеДанные.СерияНоменклатуры);
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ОбновитьАртикулНоменклатуры", Истина);
	//ОбработатьСтрокуТабличнойЧастиНоменклатуры(ТекущиеДанные.ПолучитьИдентификатор(), СтруктураДействий);

КонецПроцедуры

&НаКлиенте
Процедура ШтрихкодПриИзменении(Элемент)

	ОбработатьВводШтрихкодаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВводШтрихкодаНаКлиенте()

	ТекущаяСтрока = Неопределено;
	Модифицированность = Истина;
	Если НЕ ЗначениеЗаполнено(СокрЛП(Штрихкод)) Тогда
		Возврат;
	КонецЕсли;
	ОбработатьВводШтрихкодаНаСервере();

	Если РучнойВводКоличества И ШтрихкодНайден Тогда
		//ТекущийЭлемент = Элементы.Номенклатура;
		ОткрытьФорму("ОбщаяФорма.ФормаВводаКоличества", , ЭтотОбъект);
		Возврат;
	КонецЕсли;

	//Штрихкод = "";

КонецПроцедуры

&НаСервере
Процедура ОбработатьВводШтрихкодаНаСервере()

	ВыборкаШтрихкода = Разработка.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	ШтрихкодНайден = (ВыборкаШтрихкода.Количество() <> 0);
	Если ВыборкаШтрихкода.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШтрихкода, , "Штрихкод");
		КоличествоУчет = Разработка.ПолучитьОстаток(Номенклатура, Объект.Склад, СерияНоменклатуры, ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
		Если НЕ РучнойВводКоличества Тогда
			ДобавитьОбработатьСтрокуТоваров();
		КонецЕсли;
		Штрихкод = "";
	Иначе
		Сообщить("По штрихкоду """ + СокрЛП(Штрихкод) + """ не знайдено жодного товару!");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьОбработатьСтрокуТоваров()

	МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры", Номенклатура, СерияНоменклатуры, ХарактеристикаНоменклатуры, ));
	Если МассивСтрок.Количество() > 0 Тогда
		СтрокаТовары = МассивСтрок[0];
	Иначе
		СтрокаТовары = Объект.Товары.Вставить(0);
		//СтрокаТовары.Артикул = Номенклатура.Артикул;
	КонецЕсли;
	СтрокаТовары.Номенклатура = Номенклатура;
	СтрокаТовары.Штрихкод = СокрЛП(Штрихкод);
	СтрокаТовары.СерияНоменклатуры = СерияНоменклатуры;
	СтрокаТовары.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	СтрокаТовары.ЕдиницаИзмерения = ЕдиницаИзмерения;
	СтрокаТовары.Коэффициент = Коэффициент;
	СтрокаТовары.Количество = СтрокаТовары.Количество + ?(РучнойВводКоличества, РучноеКоличество, 1);
	СтрокаТовары.КоличествоУчет = КоличествоУчет;
	СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоУчет И СтрокаТовары.КоличествоУчет > 0);
	Количество = СтрокаТовары.Количество;
	ТекущаяСтрока = СтрокаТовары.ПолучитьИдентификатор();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьДополнительныеДанныеВТоварахНаСервере();

	РежимОбновленияКартинок = Константы.РежимОбновленияКартинок.Получить();

	УправлениеФормамиСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеДанныеВТоварахНаСервере()

	Для Каждого СтрокаТовары Из Объект.Товары Цикл
		СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоУчет И СтрокаТовары.КоличествоУчет > 0);
		//СтрокаТовары.Артикул = СтрокаТовары.Номенклатура.Артикул;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНоменклатурыПриИзменении(Элемент)
	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	//ТекущиеДанные.КоличествоУчет = Разработка.ПолучитьОстаток(ТекущиеДанные.Номенклатура, Объект.Склад,
	//								ТекущиеДанные.СерияНоменклатуры, ТекущиеДанные.ТекущиеДанные.СерияНоменклатуры);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуТабличнойЧастиНоменклатуры(ИдентификаторСтроки, СтруктураДействий)

	СтрокаТовары = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если СтруктураДействий.Свойство("ОбновитьАртикулНоменклатуры") Тогда
		//СтрокаТовары.Артикул = СтрокаТовары.Номенклатура.Артикул;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчетнымиОстатками(Команда)

	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Сообщить("Не вказано склад!");
		Возврат;
	КонецЕсли;

	Если Объект.Товары.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтотОбъект);
		ТекстВопроса = "Табличну частину товарів буде перезаповнено. Продовжити?";
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;

	ЗаполнитьУчетнымиОстаткамиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетнымиОстаткамиНаСервере()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Если ЗначениеЗаполнено(Объект.Группа) Тогда
		Запрос.УстановитьПараметр("Группа", Объект.Группа);
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ НоменклатураГруппы
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	НЕ СпрНоменклатура.ПометкаУдаления
		|	И НЕ СпрНоменклатура.ЭтоГруппа
		|	И СпрНоменклатура.Родитель В ИЕРАРХИИ(&Группа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНаСкладахМобильныеСклад.Номенклатура КАК Номенклатура,
		|	ОстаткиНаСкладахМобильныеСклад.Номенклатура.Артикул КАК Артикул,
		|	ОстаткиНаСкладахМобильныеСклад.Номенклатура.Наименование КАК Наименование,
		|	ОстаткиНаСкладахМобильныеСклад.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ОстаткиНаСкладахМобильныеСклад.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ОстаткиНаСкладахМобильныеСклад.Количество КАК КоличествоУчет
		|ИЗ
		|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК ОстаткиНаСкладахМобильныеСклад
		|ГДЕ
		|	ОстаткиНаСкладахМобильныеСклад.Склад = &Склад
		|	И ОстаткиНаСкладахМобильныеСклад.Номенклатура В
		|			(ВЫБРАТЬ
		|				НоменклатураГруппы.Ссылка
		|			ИЗ
		|				НоменклатураГруппы КАК НоменклатураГруппы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	Иначе
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ОстаткиНаСкладахМобильныеСклад.Номенклатура КАК Номенклатура,
		|	ОстаткиНаСкладахМобильныеСклад.Номенклатура.Артикул КАК Артикул,
		|	ОстаткиНаСкладахМобильныеСклад.Номенклатура.Наименование КАК Наименование,
		|	ОстаткиНаСкладахМобильныеСклад.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ОстаткиНаСкладахМобильныеСклад.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ОстаткиНаСкладахМобильныеСклад.Количество КАК КоличествоУчет
		|ИЗ
		|	РегистрСведений.vrgОстаткиНаСкладахМобильныеСклад КАК ОстаткиНаСкладахМобильныеСклад
		|ГДЕ
		|	ОстаткиНаСкладахМобильныеСклад.Склад = &Склад
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопрос(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьУчетнымиОстаткамиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВводаКоличества" Тогда
		Если ТипЗнч(ВыбранноеЗначение) <> Тип("Число") ИЛИ НЕ ВыбранноеЗначение > 0 Тогда
			Возврат;
		КонецЕсли;
		РучноеКоличество = ВыбранноеЗначение;
		ДобавитьОбработатьСтрокуТоваров();
		Штрихкод = "";
		//ТекущийЭлемент = Элементы.Штрихкод;
		//#Если МобильноеПриложениеКлиент Тогда
		//НачатьРедактированиеЭлемента();
		//#КонецЕсли

	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаВыбораСтрокиТовара" Тогда

		Модифицированность = Истина;
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ВыбранноеЗначение.НомерСтроки > Объект.Товары.Количество() Тогда
			ТекущиеДанные = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
		Иначе
			ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
		КонецЕсли;
		ТекущаяСтрока = ТекущиеДанные.ПолучитьИдентификатор();
		ТекущиеДанные.КоличествоУчет = ВыбранноеЗначение.Остаток;
		Элементы.Товары.ТекущаяСтрока = ТекущаяСтрока;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	// для того, чтобы точно клавиатура пряталась или открывалась
	//Если ТекущаяСтраница = Элементы.СтраницаСканирование Тогда
	//	ТекущийЭлемент = Элементы.Штрихкод;
	//	НачатьРедактированиеЭлемента();
	//Иначе
	//	//ТекущийЭлемент = Элементы["ДекорацияДляФокусировки" + ТекущаяСтраница.Имя];
	//	//НачатьРедактированиеЭлемента()
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтрокТаблицыТоваров(ПодстрокаПоиска)

	Если Не ЗначениеЗаполнено(ПодстрокаПоиска) Тогда
		Элементы.Товары.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;

	Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Штрихкод", ПодстрокаПоиска);

КонецПроцедуры

&НаКлиенте
Процедура НайтиНоменклатуруПоВхождению(Команда)

	УстановитьОтборСтрокТаблицыТоваров(СокрЛП(СтрокаПоиска));

КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)

	Если НЕ ЗначениеЗаполнено(СокрЛП(СтрокаПоиска)) Тогда
		УстановитьОтборСтрокТаблицыТоваров(СокрЛП(СтрокаПоиска));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПараметрыНоменклатуры(Команда)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		Сообщить("У поточному рядку не вказана номенклатура");
		Возврат;
	КонецЕсли;

	ОписаниеОповещенияОЗакрытииРедактированияНоменклатуры = Новый ОписаниеОповещения("ЗакрытиеРедактированияНоменклатуры", ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", Новый Структура("Ключ, ИдентификаторСтроки, ИзменениеПараметровНоменклатуры",
						ТекущиеДанные.Номенклатура, Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор(), Истина), ЭтаФорма,
						, , , ОписаниеОповещенияОЗакрытииРедактированияНоменклатуры);
	ОткрытаФормаРедактированияНоменклатуры = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеРедактированияНоменклатуры(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

	ОткрытаФормаРедактированияНоменклатуры = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура СканироватьЧерезКамеруУстройства(Команда)

	НажатаКомандаСканированияЧерезКамеру = Истина;
	ЗапуститьСканированиеЧерезКамеруУстройства();

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСканированиеЧерезКамеруУстройства()

	ИдетСканированиеЧерезКамеру = Истина;
	РучнойВводКоличества = Ложь;
	#Если МобильноеПриложениеКлиент Тогда
	ОбработчикСканирования = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗавершение", ЭтаФорма);
	ОбработчикЗакрытия = Новый ОписаниеОповещения("ПоказатьСканированиеШтрихКодовЗакрытие", ЭтаФорма);
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(, ОбработчикСканирования, ОбработчикЗакрытия, ТипШтрихКода.Линейный);
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПроверитьОстановитьСканированиеЧерезКамеруУстройства()

	Если ИдетСканированиеЧерезКамеру Тогда
		ПрограммноеЗакрытиеСканированияЧерезКамеру = Истина;
		#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		#КонецЕсли
		ИдетСканированиеЧерезКамеру = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗавершение(ОтсканированныйШтрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт

	Штрихкод = СокрЛП(ОтсканированныйШтрихкод);
	ОбработатьВводШтрихкодаНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСканированиеШтрихКодовЗакрытие(ДополнительныеПараметры) Экспорт

	Если НЕ ПрограммноеЗакрытиеСканированияЧерезКамеру Тогда
		НажатаКомандаСканированияЧерезКамеру = Ложь;
	КонецЕсли;
	ПрограммноеЗакрытиеСканированияЧерезКамеру = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)

	Записать();
	Закрыть();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	//ПланыОбмена.ЗарегистрироватьИзменения(Константы.УзелЦентральнойБазы.Получить(), Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СкрыватьОтсканированныеПриИзменении(Элемент)

	Элементы.Товары.ОтборСтрок = Неопределено;
	Если СкрыватьОтсканированные Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Отсканировано", Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	СтрокаТовары = Элементы.Товары.ТекущиеДанные;
	СтрокаТовары.Отсканировано = (СтрокаТовары.Количество = СтрокаТовары.КоличествоУчет И СтрокаТовары.КоличествоУчет > 0);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;
	ОткрытьФормуВыбораСтрокиТовара(Истина, Копирование);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)

	Отказ = Истина;
	ОткрытьФормуВыбораСтрокиТовара(, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораСтрокиТовара(Добавление = Ложь, Копирование = Ложь)

	СтруктураСтрокаТовары = ПолучитьСтруктуруСтрокиТабЧастиТовары(Добавление, Копирование);
	ПараметрыФормы = Новый Структура("СтруктураСтрокаТовары", СтруктураСтрокаТовары);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтрокиТовара", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Функция ПолучитьЦветСтроки(СтрокаТабличнойЧасти)

	ЦветФонаСтроки = Новый Цвет;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат ЦветФонаСтроки;
	КонецЕсли;

	Если СтрокаТабличнойЧасти.КоличествоУчет <> 0 И СтрокаТабличнойЧасти.КоличествоУчет <> СтрокаТабличнойЧасти.Количество И СтрокаТабличнойЧасти.Количество <> 0 Тогда
		ЦветФонаСтроки = WebЦвета.Розовый;
	ИначеЕсли СтрокаТабличнойЧасти.КоличествоУчет <> 0 И СтрокаТабличнойЧасти.КоличествоУчет = СтрокаТабличнойЧасти.Количество Тогда
		ЦветФонаСтроки = WebЦвета.БледноЗеленый;
	ИначеЕсли СтрокаТабличнойЧасти.КоличествоУчет = 0 И СтрокаТабличнойЧасти.Количество <> 0 Тогда
		ЦветФонаСтроки = WebЦвета.СветлоЗолотистый;
	КонецЕсли;

	Возврат ЦветФонаСтроки;

КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеФормамиКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	ПодключитьОбработчикАвтосохранения();

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикАвтосохранения()

	Если ИспользоватьАвтосохранение <> Истина
		ИЛИ ИнтервалАвтосохранения = 0 Тогда
			Возврат;
	КонецЕсли;

	ПодключитьОбработчикОжидания("ВыполнитьАвтосохранениеДокумента", ИнтервалАвтосохранения);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьАвтосохранениеДокумента() Экспорт

	Автосохранение = Истина;
	Попытка
		Записать();
	Исключение
	КонецПопытки;
	Автосохранение = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)

	УправлениеФормамиКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьСписокФото(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Сообщить("Сохраните документ для создания фото!");
	Иначе 	
		
		Объект.УИДДокумента = Объект.Ссылка.УникальныйИдентификатор(); 
		Модифицированность = Истина;
		Записать();
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыОтбора = Новый Структура("УИД",Объект.Ссылка.УникальныйИдентификатор());
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("УИД",Объект.Ссылка.УникальныйИдентификатор());
		ПараметрыФормы.Вставить("Наименование",Объект.Номер);
		ПараметрыФормы.Вставить("Склады",Null);
		ПараметрыФормы.Вставить("типДок",Объект.Ссылка);
		
		ОткрытьФорму("ОбщаяФорма.ПросмотрФотоДок", ПараметрыФормы, ЭтотОбъект);
		
	КонецЕсли;
КонецПроцедуры
